var
  number: longint;

begin
  readln(number);
  number := number div 100000 mod 1000;
  writeln(number);
end.
// ID	  Задача	acc	status
//a01	  Переменные и выражения. Код города	6	
//a02	  Переменные и выражения. Нахождение квадрата трехзначного числа	4	
//a03	  Переменные и выражения. Путь улитки	4	
//a04	  Переменные и выражения. Нахождение количества различных чисел по их числу пар	0	
//a05	  Переменные и выражения. Нахождение корней квадратного уравнения	0	
//a06	  Переменные и выражения. Площадь прямоугольника	1	
//a07	  Переменные и выражения. Восстановление двух чисел по их сумме и разности		
//a08	  Переменные и выражения. Максимальное число квадратов	0	
//a09	  Переменные и выражения. Сумма подряд идущих чисел		
//a10	  Переменные и выражения. Прикладная химия		
